Revit 2027 API
PointCloudType.EngineIdentifier Property
 The identifier of the engine responsible for handling of the point cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string EngineIdentifier { get; }
Public ReadOnly Property EngineIdentifier As String
	Get
public:
property String^ EngineIdentifier {
	String^ get ();
}
member EngineIdentifier : string with get
Property Value
String
Remarks
 The built-in engine provides "rcs" and "rcp" here.
See Also
Reference
PointCloudType Class
Autodesk.Revit.DB Namespace